{
    "entries": [

      {
        "key": "EBTHAUMIUM",
        "name": "Essentia Boosted Thaumium",
        "icons": ["gregtech:meta_ingot;1;32001"],
        "category": "METALLURGY",
        "location": [0, 1],
        "stages": [
            {
                "text": "As of late, i've been pondering about the industrial uses of a material like Thaumium. It's too soft to use for electrical machines, but i may have a use for it... Though i will have to conduct some basic experiments to figure this out.",
                "required_item": ["thaumcraft:ingot"],
                "required_knowledge": ["OBSERVATION;INFUSION;1"]
              },
              {
                "text": "Eureka! Of course, why did i not realize this before? Infusing a material like Thaumium can give me something much more useful for industry; By infusing some Thaumium with some Mithrillium and other exotic materials i get Essentia Boosted Thaumium. This new material has some very unique superconducting properties that are sure to be vital in my industrial endeavors."
              }
        ]
      },
      {
        "key": "BOTATHAUMA",
        "name": "Botathaumic Alloy",
        "icons": ["gregtech:meta_ingot;1;32020"],
        "category": "METALLURGY",
        "location": [-3, 1],
        "parents": ["EBTHAUMIUM"],
        "stages": [
            {
                "text": "In my relentless pursuit of knowledge, I find myself captivated by the possibility of creating a new material. By merging Manasteel with Essentia-Boosted Thaumium, I believe I could unlock a substance of unmatched strength and versatility. The thought of harnessing the arcane properties of Essentia fills me with ambition. If my theories hold true, this fusion could yield tools and wires with astonishing superconductive capabilities.",
                "required_item": ["botania:manaresource"],
                "required_knowledge": ["THEORY;INFUSION;2"],
                "warp": 1
              },
              {
                "text": "By combining Terrasteel with Essentia-Boosted Thaumium, I have created a material that shimmers with magical energy. My first tool, crafted from this Alloy, astonished me with its strength and remarkable durability, though its mining level remains surprisingly low."
              }
        ]
      },
      {
      "key": "VITALIUM",
      "name": "Botathaumic Alloy",
      "icons": ["gregtech:meta_ingot;1;32107"],
      "category": "METALLURGY",
      "location": [-3, 4],
      "parents": ["BOTATHAUMA"],
      "stages": [
          {
              "text": "Looking at the Blood Mages of yesteryear, i now realize the potential that Life Essence and Demonic Energy have. Sentient Armor and tools, that are nigh-on indestructible because of their Regeneration properties. Maybe, i could replicate this using Essentia?",
              "required_item": ["bewitchment:demon_heart"],
              "required_knowledge": ["THEORY;INFUSION;4", "THEORY;AUROMANCY;2"],
              "warp": 5
            },
            {
              "text": "This did not turn out as expected. Instead of getting a sentient material, that can regenerate itself, i have got a.. not-so-alive-anymore dust that appears to be composed of lost souls from the Underworld. When i tried smelting it, it became into a hard, crystalline, and nigh indestructible metal. Not what i wanted, but this is pretty good regardless. An unbreakable material? Who wouldn't want that?"
            }
      ]
      }
    ]
  }
    
