{
    "entries": [

      {
        "key": "BEGINNINGWITCH",
        "name": "Looking to the Edges",
        "icons": ["bewitchment:pentacle"],
        "category": "WITCHERY",
        "location": [0, 0],
        "stages": [
            {
                "text": "Sometimes, alchemy is not enough. Sometimes, we have to.. Look to the Edges."
              },
              {
                "text": "Witchcraft has always captivated me. I have read books and listened to tales of many a powerful witch controlling their foes with Poppets, or summoning evil demons to do their bidding. What if i engaged myself in this art too?"
              }
        ]
      },
      {
        "key": "WITCHINGTOOLS",
        "name": "Witchcraft Machinery",
        "icons": ["bewitchment:witches_oven"],
        "category": "WITCHERY",
        "location": [-3, 1],
        "parents": ["BEGINNINGWITCH"],
        "stages": [
            {
                "text": "Any good witch needs their tools.. Perhaps further dusting my Crucible with Salis Mundus could improve its witching capabilities. I need to take apart a crucib",
                "required_item": ["thaumcraft:crucible"],
                "required_knowledge": ["THEORY;ALCHEMY;1"],
                "warp": 0
              },
              {
                "text": "A fashionable oven, made to withstand the pressures of elixir-making."
              }
        ]
            },

              {
                "key": "DISTILLERYW",
                "name": "Distillery",
                "icons": ["bewitchment:distillery"],
                "category": "WITCHERY",
                "location": [-2, 1],
                "parents": ["BEGINNINGWITCH"],
                "stages": [
                    {
                        "text": "Regular brewing-stands and extracting machinae are not enough for the more Advanced processes required for Witchcraft. Though, I think i may be able to engineer a machine that can handle these stresses..",
                        "required_item": ["bewitchment:distillery"],
                        "required_knowledge": ["THEORY;ALCHEMY;1"],
                        "warp": 0
                      },
                      {
                        "text": "The Distillery is a machine capable of extracting pure essences, things that are purer than Essentia itself.."
                      }
                    ]

      },
                  {
                    "key": "CAULDWITCH",
                    "name": "Magicker Cauldrons",
                    "icons": ["bewitchment:witches_cauldron"],
                    "category": "WITCHERY",
                    "location": [-1, 1],
                    "parents": ["BEGINNINGWITCH"],
                    "stages": [
                        {
                            "text": "Regular brewing-stands and extracting machinae are not enough for the more Advanced processes required for Witchcraft. Though, I think i may be able to engineer a machine that can handle these stresses.. I shall need to dust an Essentia Smeltery to find out.",
                            "required_item": ["bewitchment:witches_cauldron"],
                            "required_knowledge": ["THEORY;ALCHEMY;1"],
                            "warp": 0
                          },
                          {
                            "text": "The Witches' Cauldron is a station capable of brewing advanced potions, Much beyond the capabilities of basic potions..."
                          }
                        ]
                      },
                      {
                        "key": "WALTAR",
                        "name": "Magicker Cauldrons",
                        "icons": ["bewitchment:stone_witches_altar"],
                        "category": "WITCHERY",
                        "location": [2, 1],
                        "parents": ["BEGINNINGWITCH"],
                        "stages": [
                            {
                                "text": "The demons will not rise if i do not summon them. An altar should allow me to pique the interest of the demons, and also gain some more exotic materials..",
                                "required_item": ["thaumcraft:metal_alchemical"],
                                "required_knowledge": ["THEORY;ALCHEMY;1"],
                                "warp": 2
                              },
                              {
                                "text": "This Altar should be able to arise the curiosity of the Demons. I should add some greenery around it, to increase the power of the Altar... Maybe some other kinds of magic implements would also serve me well."
                              }
                            ]
                          },
                          {
                            "key": "WSPINWHEEL",
                            "name": "Magical Looms",
                            "icons": ["bewitchment:spinning_wheel"],
                            "category": "WITCHERY",
                            "location": [1, 1],
                            "parents": ["BEGINNINGWITCH"],
                            "stages": [
                                {
                                    "text": "Regular crafting tables are not sufficient for crafting string efficiently, let alone crafting magical fibres... I may be able to engineer a machine that allows me to handle fibres more accurately, thus allowing for the creation of some very special fibres...",
                                    "required_item": ["thaumcraft:fabric"],
                                    "required_knowledge": ["THEORY;ARTIFICE;1"],
                                    "warp": 0
                                  },
                                  {
                                    "text": "The Spinning Wheel should help me weave delicate fibers, infused with the essence of Vis."
                                  }
                                ]
                              }

    ]
  }
  